#### BuiltInFailures.JoinElementsFailures Members

---

|  |
| --- |
| BuiltInFailures JoinElementsFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures JoinElementsFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CannotCope | Can't apply Coping. |
| Public property Static member | CannotCutJoinedGeometry | Element could not be cut by joined element. |
| Public property Static member | CannotJoinDesignOptions | An element cannot join to an element in a secondary Design Option unless it is in the same secondary Design Option. |
| Public property Static member | CannotJoinElements | Can't keep elements joined. |
| Public property Static member | CannotJoinElementsError | Can't keep elements joined. |
| Public property Static member | CannotJoinElementsMultiPlaneError | Can't keep elements joined. |
| Public property Static member | CannotJoinElementsStructural | Can't keep elements joined. |
| Public property Static member | CannotJoinElementsStructuralError | Can't keep elements joined. |
| Public property Static member | CannotJoinElementsWarn | Can't keep elements joined. |
| Public property Static member | CannotJoinRoof | The roof cannot be joined. |
| Public property Static member | CannotJoinRoofError | The roof cannot be joined. |
| Public property Static member | CannotKeepJoined | Can't keep elements joined. |
| Public property Static member | CannotKeepReferenceOfJoinedElement | Can't keep reference of joined element. |
| Public property Static member | CannotKeepReferenceOfJoinedElementWarning | Can't keep reference of joined element. |
| Public property Static member | CannotKeepTrussJoined | Can't keep the highlighted [Element]s joined. |
| Public property Static member | CannotKeepWallJoinToRoof | Can't keep wall and [target] joined |
| Public property Static member | CannotKeepWallJoinToRoofError | Can't keep wall and [target] joined |
| Public property Static member | ElementWillBeDetachedFromPlane | Element will be detached from its associated plane |
| Public property Static member | FootingWillMoveToBottom | An attached Structural Foundation will be moved to the bottom of the Column. |
| Public property Static member | JoiningDisjoint | Highlighted elements are joined but do not intersect. |
| Public property Static member | JoiningDisjointWarn | Highlighted elements are joined but do not intersect. |
| Public property Static member | StairsComponentTypeUnsupportedError | The selected stair type/shape isn't supported for attaching a wall to a stair. To continue, detach the wall from the stairs' components. |
| Public property Static member | StructGroupMemberWillDetachFromGrid | A structural element will be detached from grid(s) due to inconsistent group membership. |
| Public property Static member | WallTypeUnsupportedError | The selected wall type/shape isn't supported for attaching a wall to a stair. To continue, detach the wall from the stairs' components. |

# See Also

BuiltInFailures JoinElementsFailures Class

Autodesk.Revit.DB Namespace